window.onload = () => {
    const mas_prize = [
        'Ти дуже миленька',
        'Від твоєї краси темніє і очах!',
        'Ти чарівна і неймовірна!',
        'Люди щасливі просто бути поруч з тобою',
        'Світ став би набагато кращим, якщо б більшість людей були схожі на тебе',
        'Твоя посмішка зачаровує',
        'Ти найдобріша людина на світі',
        'Ти найкрасивіша з усіх казкових принцес',
        'Всесвіт створив своє найкраще творіння - тебе',
        'Є межа досконалості - це ти',
        'Як жити на світі з такою красою?',
        'Вам не соромно бути такою гарною?',
        'Ти не втілення мрії, а мрія втілення тебе',
        'Коли Бог роздавав красу, ти вставала двічі чи тричі?',
        'Твоя зовнішність така ж гарна, як твоя чарівна душа',
        'Твій голос-наче музика, а риси обличчя, як пейзажі красот природи!',
        'В тобі немає вад і навіть те, що ти вважаєш недоліками – гідності в очах інших людей!',
        'У тебе сама приваблива і мила усмішка на світі!',
        'Навіть Афродита — бліда копія твоєї краси.',
        'Ти, як сонце, висвітлюєш все навколо, і як веселка, вносиш фарби і позитивний настрій!',
        'Твоя посмішка – це найніжніше, що я бачив на землі!',
        'Коли ти посміхаєшся, сонце виходить з-за хмар, а коли смієшся – на небі з’являється веселка',
        'Ти – втілення мрії!',
        'Спасибі твоїм батькам, що дали світові таке досконале створення, як ти',
        'Ти — неповторна! Ти — чарівна! Ти — неперевершена!',
        'Ти справжній джерело доброти, щастя і радості!'
    ]

    function getRandomInt(max) {
        return Math.floor(Math.random() * max);
    }
    
    const box = document.querySelector('.box')
    console.log(box);
    box.addEventListener("click", ()=> {
         document.body.innerHTML = `<div class="prize">${mas_prize[getRandomInt(mas_prize.length-1)]}</div> <div class="ttt">З Хеловіном. Бажаю веселого і захоплюючого життя без страхів, втрат, прикрощів та негараздів. Нехай чорний кіт ніколи не перебігає тобі жодної дороги, нехай кожен день твого життя сплітаються в одну велику і міцну павутину щастя</div>`
        document.body.innerHTML += 
            `<div class="bat bat-1"></div>`
    })

}
